---
kind: other
id: Methods.T:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangularBar
source: html/5a09425a-f9ec-daa4-2e07-c41b78425402.htm
---
# StructuralSectionRectangularBar Methods

Returns size of the section boundary.